"""
12.
"""
js에 대하여..

Java : 완벽한 언어
변수 선언 : 데이터 타입 변수명 ; 데이터 타입 변수명=초기값;
메서드 선언 : 접근제한자 반환타입 메서드명 (데이터 타입 매개변수 리스트) { }
메서드 선언 : 접근제한자 반환데이터 타입 메서드명 (데이터 타입 매개변수 리스트) {return 반환데이터; }

클래스 선언 : 접근제한자 class 클래스명 {
접근제한자 데이터타입 변수명;
   
   }
   
js : 데이터 타입이 없다!!!!
	변수 선언 : var 변수명; / var 변수명 = 초기값;
	함수 선언 : function 함수명 (매개변수 리스트) { }
	함수 선언 : function 함수명 (매개변수 리스트) {return 반환 데이터;}
	
	변수에 함수 저장 가능
	var fun = function (  ) {   }
	
	var o = new Object(  ) ;
	o.a = 1;
	o.b = "문자";
	
	var o2 = {a : 1, b : "문자열"};
	
js를 사용하는 이유
	html 태그에 대한 이벤트를 처리하기 위함!!!
	ex. 버튼 클릭에 대한 반응을 확인하고, 그 결과를 처리..
	
============================================
js 제공(내장) 객체
	1. document 객체 : <body></body>
	    querySelector() : 태그 / id / class명을 이용하여 <body></body> 안의 요소를 추출
	    write() : <body></body> 사이에 직접 컨텐츠를 쓰는 함수
	    
	    querySelector()로 추출된 태그 객체의 innerHTML 속성
	    	=> 추출된 태그 객체의 시작 태그와 닫는 태그 사이에 새로운 내용을 삽입,
	    	       innerHTML = "새로운 내용";
	    	=> 내부의 내용을 추출할 수 있는 속성
	    	      var  변수명 = ~~~.innerHTML;
	    	      
  2. Date 객체 : 현재 시스템 날짜 및 시간을 추출할 수 있는 객체
      toLocaleTimeString() : 	Date 객체로부터 현재 지역의 시간을 문자열로 반환하는 함수
